<template>

  <v-row :items="items" class="featured-questions">
    <v-col>
      <div class="inner">
        <div class="question-box" v-for="(item, i) in hits" :key="i">
          <NuxtLink to="">
            <p class="question mb-1">{{ item.source.question }}</p>
          </NuxtLink>
          <NuxtLink to="'/profile/3'">
            <p class="user mb-3">
              <v-icon class="text-main">mdi-account-circle</v-icon>
              پرسیده شده توسط مهدی
            </p>
          </NuxtLink>
        </div>
      </div>
    </v-col>
  </v-row>

</template>

<script>
  export default {
    props: ['items'],
    data: () => ({
      hits: [
				{
					"source": {
						"id": 17,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "مدارک",
								"title": "Documents"
							},
						]
					},
				},
				{
					"source": {
						"id": 18,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است2؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "ثبت نام",
								"title": "Documents"
							},
						]
					},
				},
				{
					"source": {
						"id": 18,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است2؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "ثبت نام",
								"title": "Documents"
							},
						]
					},
				},
				{
					"source": {
						"id": 18,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است2؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "ثبت نام",
								"title": "Documents"
							},
						]
					},
				},
				{
					"source": {
						"id": 18,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است2؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "ثبت نام",
								"title": "Documents"
							},
						]
					},
				},
				{
					"source": {
						"id": 18,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است2؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "ثبت نام",
								"title": "Documents"
							},
						]
					},
				},
				{
					"source": {
						"id": 18,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است2؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "ثبت نام",
								"title": "Documents"
							},
						]
					},
				},
				{
					"source": {
						"id": 18,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است2؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "ثبت نام",
								"title": "Documents"
							},
						]
					},
				},
				{
					"source": {
						"id": 18,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است2؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "ثبت نام",
								"title": "Documents"
							},
						]
					},
				},
				{
					"source": {
						"id": 18,
						"question": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است2؟",
						"answer": "چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
						"hashTags": [
							{
								"id": 0,
								"alias": "کد بورسی",
								"title": "Bourse Code"
							},
							{
								"id": 0,
								"alias": "ثبت نام",
								"title": "Documents"
							},
						]
					},
				},
			]
    }),
    created: function () {

    },
  }
</script>

<style lang="scss" scoped>
@import '~/assets/scss/_variables.scss';
@import '~/assets/scss/_mixins.scss';

.featured-questions {

  .inner {
    padding: 20px;
    background: #f8f8f8;

    .question-box {
      margin-bottom: 10px;

      &:not(:last-child) {
        border-bottom: 1px solid #eee;
      }

      p {
        font-size: 12px;
        line-height: 22px;
        color: #666;
        transition: 0.1s;

        &.question {
          font-family: $f-m;
          color: $cb;
        }
        
        &:hover {
          color: $c1;
        }

        i {
          font-size: 18px;
        }
      }
    }
  }
}


</style>
